app/Controllers/Blog.php

SELECT `id`, `name`
FROM `categories`
ORDER BY `name` ASC
 LIMIT 3
---
        public function __construct()
    {
        $this->request = \Config\Services::request();
        $this->session = session();
        $this->db = db_connect();
        $this->auth_model = new Auth;
        $this->category_model = new Categories;
        $this->post_model = new Posts;
        $menu_cat = $this->category_model->select("id, name")->orderBy('name','asc')->limit(3)->find();

SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `status` = 1
SELECT *
FROM `posts`
WHERE `status` = 1
ORDER BY abs(unix_timestamp(created_at)) DESC
 LIMIT 5
---
    public function index()
    {
        $this->data['page_title'] = "Home";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  5;
        $this->data['total'] =  $this->post_model->where('status', 1)
                                ->orderBy('abs(unix_timestamp(created_at)) DESC')
                                ->countAllResults();
        $this->data['posts'] = $this->post_model->where('status', 1)
                                ->orderBy('abs(unix_timestamp(created_at)) DESC')
                                ->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `categories`
SELECT *
FROM `categories`
ORDER BY abs((name)) asc
 LIMIT 5
---
    public function categories()
    {
        $this->data['page_title'] = "Categories";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  5;
        $this->data['total'] =  $this->category_model->orderBy('abs((name)) asc')
                                ->countAllResults();
        $this->data['categories'] = $this->category_model->orderBy('abs((name)) asc')
                                ->paginate($this->data['perPage']);

SELECT *
FROM `categories`
WHERE `id` = '4'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `status` = 1
AND `category_id` = '4'
SELECT *
FROM `posts`
WHERE `status` = 1
AND `category_id` = '4'
ORDER BY abs(unix_timestamp(created_at)) DESC
 LIMIT 5
---
    public function category($id="")
    {
        if(empty($id))
        return redirect()->to('Blog/PagenotFound');

        $category = $this->category_model->where('id',$id)->first();
        if(!isset($category['id']))
            return redirect()->to('Blog/PagenotFound');
        $this->data['page_title'] = $category['name'];
        $this->data['category'] = $category;
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  5;
        $this->data['total'] =  $this->post_model
                                ->where('status', 1)
                                ->where('category_id', $id)
                                ->orderBy('abs(unix_timestamp(created_at)) DESC')
                                ->countAllResults();
        $this->data['posts'] = $this->post_model
                                ->where('status', 1)
                                ->where('category_id', $id)
                                ->orderBy('abs(unix_timestamp(created_at)) DESC')
                                ->paginate($this->data['perPage']);

SELECT `posts`.*, `users`.`email` as `author`, concat(users.name, ' - ', users.email) as author_full, `categories`.`name` as `category`
FROM `posts`
INNER JOIN `users` ON `posts`.`user_id` = `users`.`id`
INNER JOIN `categories` ON `posts`.`user_id` = `categories`.`id`
WHERE `posts`.`id` = '25'
 LIMIT 1
---
    public function view($id = ''){
        if(empty($id))
        return redirect()->to('Blog/PagenotFound');
        $post = $this->post_model
                     ->select("posts.*, users.email as author, concat(users.name, ' - ', users.email) as author_full, categories.name as category")
                     ->where("posts.id = '{$id}'")
                     ->join('users',"posts.user_id = users.id", "inner")
                     ->join('categories',"posts.user_id = categories.id", "inner")
                     ->first();