app/Controllers/Main.php

SELECT COUNT(*) AS `numrows` FROM `categories`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `type` = 2
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `posts`.`user_id` = '3'
---
    public function index()
    {
        $this->data['page_title']="Home";
        $this->data['categories']=$this->category_model->countAll();
        if($this->session->login_type == 2){
            $this->post_model->where("posts.user_id = '{$this->session->login_id}' ");
        }
        $this->data['posts']=$this->post_model->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `categories`
SELECT *
FROM `categories`
 LIMIT 10
---
    public function categories(){
        $this->data['page_title']="Categories";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->category_model->countAllResults();
        $this->data['categories'] = $this->category_model->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `posts`.`user_id` = '3'
SELECT COUNT(*) AS `numrows`
FROM `posts`
INNER JOIN `users` ON `posts`.`user_id` = `users`.`id`
WHERE `posts`.`user_id` = '3'
SELECT `posts`.*, `users`.`email` as `author`
FROM `posts`
INNER JOIN `users` ON `posts`.`user_id` = `users`.`id`
WHERE `posts`.`user_id` = '3'
 LIMIT 10
---
    public function posts(){
        $this->data['page_title']="Posts";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        if($this->session->login_type == 2){
            $this->post_model->where("posts.user_id = '{$this->session->login_id}' ");
        }
        if(!empty($this->request->getVar('search'))){
            $search = $this->request->getVar('search');
            $this->post_model->where(" `posts`.title LIKE '%{$search}%' or `posts`.short_description LIKE '%{$search}%' or `posts`.content LIKE '%{$search}%' or `posts`.tags LIKE '%{$search}%' or `posts`.user_id in (SELECT id from users where email LIKE '%{$search}%') or category_id in (SELECT id FROM `categories` where name LIKE '%{$search}%') ");
        }
        $this->data['total'] =  $this->post_model->countAllResults();
        if(!empty($this->request->getVar('search'))){
            $search = $this->request->getVar('search');
            $this->post_model->where(" `posts`.title LIKE '%{$search}%' or `posts`.short_description LIKE '%{$search}%' or `posts`.content LIKE '%{$search}%' or `posts`.tags LIKE '%{$search}%' or `users`.email LIKE '%{$search}%' or category_id in (SELECT id FROM `categories` where name LIKE '%{$search}%') ");
        }
        if($this->session->login_type == 2){
            $this->post_model->where("posts.user_id = '{$this->session->login_id}' ");
        }
        $this->data['posts'] = $this->post_model
                                ->select("posts.*, users.email as author ")
                                ->join("users", "posts.user_id = users.id", 'inner')
                                ->paginate($this->data['perPage']);

INSERT INTO `posts` (`banner`, `user_id`, `category_id`, `title`, `short_description`, `content`, `tags`, `status`) VALUES ('http://localhost:8080/public/uploads/f.jpg', '3', '2', 'Baron 1 shot', 'RADIANT 1 DAY', '&lt;p&gt;fAKER 1V1 ME AND LOST&lt;/p&gt;', 'LOL, pro, Challenger', '1')
---
            $udata['content'] = htmlspecialchars($this->db->escapeString($content));
            $udata['tags'] = htmlspecialchars($this->db->escapeString($tags));
            $udata['status'] = $status;
            $save = $this->post_model->save($udata);

UPDATE `posts` SET `banner` = 'http://localhost:8080/public/uploads/e.jpg', `user_id` = '1', `category_id` = '1', `title` = '1v5 clutch', `short_description` = 'immortal lobby ace', `content` = '&amp;lt;p&amp;gt;Please watch my twitch tv : janttv.twitch.tv/&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;br&amp;gt;&amp;lt;/p&amp;gt;', `tags` = 'Valorant, Esports, Games', `status` = '1'
WHERE `id` = '24'
---
            $udata['content'] = htmlspecialchars($this->db->escapeString($content));
            $udata['tags'] = htmlspecialchars($this->db->escapeString($tags));
            $udata['status'] = $status;
            $update = $this->post_model->where('id',$id)->set($udata)->update();

SELECT *
FROM `posts`
WHERE `id` = '24'
 LIMIT 1
SELECT *
FROM `categories`
---
            }
        }
        $this->data['page_title']="Edit Post";
        $this->data['post'] = $this->post_model->where("id ='{$id}'")->first();
        $this->data['categories'] = $this->category_model->findAll();